balazsgrill/modembed/res/Devices/dsPIC30/DSPIC30F6010A.PIC
<?xml version="1.0" ?><edc:PIC edc:arch="30xxxx" edc:desc="" edc:informedby="DOS PS DS" edc:isextended="false" edc:name="DSPIC30F6010A" edc:procid="0x1b" xmlns:edc="http://crownking/edc" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://crownking/edc edc/PIC.xsd">
  <edc:Power>
    <edc:VPP edc:defaultvoltage="13.000" edc:maxvoltage="13.250" edc:minvoltage="9.000"/>
    <edc:VDD edc:maxdefaultvoltage="5.500" edc:maxvoltage="5.500" edc:mindefaultvoltage="4.500" edc:minvoltage="2.500" edc:nominalvoltage="5.000"/>
  </edc:Power>
  <edc:Programming edc:boundary="512" edc:lvpthresh="4.500" edc:memtech="ee" edc:tries="1">
    <edc:Wait edc:cfg="2000" edc:eedata="2000" edc:erase="10000" edc:lverase="2000" edc:lvpgm="2000" edc:pgm="2000" edc:userid="2000"/>
  </edc:Programming>
  <edc:ArchDef edc:desc="30xxxx" edc:name="30xxxx">
    <edc:MemTraits>
      <edc:CodeMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xffffff" edc:wordsize="0x4"/>
      <edc:ExtCodeMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xffffff" edc:wordsize="0x4"/>
      <edc:BackgroundDebugMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xff7fff" edc:wordsize="0x4"/>
      <edc:TestMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xffffff" edc:wordsize="0x4"/>
      <edc:UserIDMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xffffff" edc:wordsize="0x4"/>
      <edc:ConfigFuseMemTraits edc:addrinc="0x2" edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:DeviceIDMemTraits edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:EEDataMemTraits edc:magicoffset="0x0"/>
      <edc:DataMemTraits edc:addrinc="0x2" edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0x0" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
    </edc:MemTraits>
  </edc:ArchDef>
  <edc:CodeGuard>
    <edc:SegRegion edc:segregion="Data">
      <edc:Seg edc:seg="Boot">
        <edc:SegNature edc:addr="0x2400" edc:id="DataBootLarge" edc:segsecurity="None" edc:segsize="Large"/>
        <edc:SegNature edc:addr="0x2700" edc:id="DataBootMed" edc:segsecurity="None" edc:segsize="Medium"/>
        <edc:SegNature edc:addr="0x2780" edc:id="DataBootSm" edc:segsecurity="None" edc:segsize="Small"/>
        <edc:SegNature edc:addr="0x0" edc:id="DataBootNone" edc:segsecurity="None" edc:segsize="None"/>
      </edc:Seg>
      <edc:Seg edc:seg="Secure">
        <edc:SegNature edc:addr="0x1800" edc:id="DataSecureLarge" edc:segsecurity="None" edc:segsize="Large"/>
        <edc:SegNature edc:addr="0x2000" edc:id="DataSecureMed" edc:segsecurity="None" edc:segsize="Medium"/>
        <edc:SegNature edc:addr="0x2700" edc:id="DataSecureSm" edc:segsecurity="None" edc:segsize="Small"/>
        <edc:SegNature edc:addr="0x0" edc:id="DataSecureNone" edc:segsecurity="None" edc:segsize="None"/>
      </edc:Seg>
      <edc:Seg edc:seg="General"/>
    </edc:SegRegion>
    <edc:SegRegion edc:segregion="EEPROM">
      <edc:Seg edc:seg="Boot">
        <edc:SegNature edc:addr="0x7fff00" edc:id="EEPROMBootSm" edc:segsecurity="None" edc:segsize="Small"/>
        <edc:SegNature edc:addr="0x0" edc:id="EEPROMBootNone" edc:segsecurity="None" edc:segsize="None"/>
      </edc:Seg>
      <edc:Seg edc:seg="Secure">
        <edc:SegNature edc:addr="0x7ff800" edc:id="EEPROMSecureLarge" edc:segsecurity="None" edc:segsize="Large"/>
        <edc:SegNature edc:addr="0x7ffe00" edc:id="EEPROMSecureMed" edc:segsecurity="None" edc:segsize="Medium"/>
        <edc:SegNature edc:addr="0x7fff00" edc:id="EEPROMSecureSm" edc:segsecurity="None" edc:segsize="Small"/>
        <edc:SegNature edc:addr="0x0" edc:id="EEPROMSecureNone" edc:segsecurity="None" edc:segsize="None"/>
      </edc:Seg>
      <edc:Seg edc:seg="General"/>
    </edc:SegRegion>
    <edc:SegRegion edc:segregion="Program">
      <edc:Seg edc:seg="Boot">
        <edc:SegNature edc:addr="0x1ffe" edc:id="PgmBootHighLarge" edc:segsecurity="High" edc:segsize="Large"/>
        <edc:SegNature edc:addr="0xffe" edc:id="PgmBootHighMed" edc:segsecurity="High" edc:segsize="Medium"/>
        <edc:SegNature edc:addr="0x3fe" edc:id="PgmBootHighSm" edc:segsecurity="High" edc:segsize="Small"/>
        <edc:SegNature edc:addr="0x1ffe" edc:id="PgmBootStdLarge" edc:segsecurity="Standard" edc:segsize="Large"/>
        <edc:SegNature edc:addr="0xffe" edc:id="PgmBootStdMed" edc:segsecurity="Standard" edc:segsize="Medium"/>
        <edc:SegNature edc:addr="0x3fe" edc:id="PgmBootStdSm" edc:segsecurity="Standard" edc:segsize="Small"/>
        <edc:SegNature edc:addr="0x0" edc:id="PgmBootNone" edc:segsecurity="None" edc:segsize="None"/>
        <edc:SegWriteProtect edc:disableid="PgmBootWrtProtectOff" edc:enableid="PgmBootWrtProtectOn"/>
      </edc:Seg>
      <edc:Seg edc:seg="Secure">
        <edc:SegNature edc:addr="0x7ffe" edc:id="PgmSecureHighLarge" edc:segsecurity="High" edc:segsize="Large"/>
        <edc:SegNature edc:addr="0x3ffe" edc:id="PgmSecureHighMed" edc:segsecurity="High" edc:segsize="Medium"/>
        <edc:SegNature edc:addr="0x1ffe" edc:id="PgmSecureHighSm" edc:segsecurity="High" edc:segsize="Small"/>
        <edc:SegNature edc:addr="0x7ffe" edc:id="PgmSecureStdLarge" edc:segsecurity="Standard" edc:segsize="Large"/>
        <edc:SegNature edc:addr="0x3ffe" edc:id="PgmSecureStdMed" edc:segsecurity="Standard" edc:segsize="Medium"/>
        <edc:SegNature edc:addr="0x1ffe" edc:id="PgmSecureStdSm" edc:segsecurity="Standard" edc:segsize="Small"/>
        <edc:SegNature edc:addr="0x0" edc:id="PgmSecureNone" edc:segsecurity="None" edc:segsize="None"/>
        <edc:SegWriteProtect edc:disableid="PgmSecureWrtProtectOff" edc:enableid="PgmSecureWrtProtectOn"/>
      </edc:Seg>
      <edc:Seg edc:seg="General">
        <edc:SegNature edc:addr="0x17ffe" edc:id="PgmGenHigh" edc:segsecurity="High" edc:segsize="None"/>
        <edc:SegNature edc:addr="0x17ffe" edc:id="PgmGenStd" edc:segsecurity="Standard" edc:segsize="None"/>
        <edc:SegNature edc:addr="0x17ffe" edc:id="PgmGenNone" edc:segsecurity="None" edc:segsize="None"/>
        <edc:SegWriteProtect edc:disableid="PgmGenWrtProtectOff" edc:enableid="PgmGenWrtProtectOn"/>
      </edc:Seg>
    </edc:SegRegion>
  </edc:CodeGuard>
  <edc:WatchdogTimer edc:min="2"/>
  <edc:InterruptList>
    <edc:Trap edc:cname="ReservedTrap0" edc:desc="Reserved"/>
    <edc:Trap edc:cname="OscillatorFail" edc:desc="Oscillator Fail Trap vector"/>
    <edc:Trap edc:cname="AddressError" edc:desc="Address error Trap vector"/>
    <edc:Trap edc:cname="StackError" edc:desc="Stack Error Trap vector"/>
    <edc:Trap edc:cname="MathError" edc:desc="Math Error Trap vector"/>
    <edc:Trap edc:cname="ReservedTrap5" edc:desc="Reserved"/>
    <edc:Trap edc:cname="ReservedTrap6" edc:desc="Reserved"/>
    <edc:Trap edc:cname="ReservedTrap7" edc:desc="Reserved"/>
    <edc:Interrupt edc:cname="INT0Interrupt" edc:desc="INT0 - External Interrupt 0" edc:irq="0"/>
    <edc:Interrupt edc:cname="IC1Interrupt" edc:desc="IC1 - Input Capture 1" edc:irq="1"/>
    <edc:Interrupt edc:cname="OC1Interrupt" edc:desc="OC1 - Output Compare 1" edc:irq="2"/>
    <edc:Interrupt edc:cname="T1Interrupt" edc:desc="T1 - Timer1" edc:irq="3"/>
    <edc:Interrupt edc:cname="IC2Interrupt" edc:desc="IC2 - Input Capture 2" edc:irq="4"/>
    <edc:Interrupt edc:cname="OC2Interrupt" edc:desc="OC2 - Output Compare 2" edc:irq="5"/>
    <edc:Interrupt edc:cname="T2Interrupt" edc:desc="T2 - Timer2" edc:irq="6"/>
    <edc:Interrupt edc:cname="T3Interrupt" edc:desc="T3 - Timer3" edc:irq="7"/>
    <edc:Interrupt edc:cname="SPI1Interrupt" edc:desc="SPI1 - SPI1 Transfer Done" edc:irq="8"/>
    <edc:Interrupt edc:cname="U1RXInterrupt" edc:desc="U1RX - UART1 Receiver" edc:irq="9"/>
    <edc:Interrupt edc:cname="U1TXInterrupt" edc:desc="U1TX - UART1 Transmitter" edc:irq="10"/>
    <edc:Interrupt edc:cname="ADCInterrupt" edc:desc="ADC1 - A/D Converter 1" edc:irq="11"/>
    <edc:Interrupt edc:cname="NVMInterrupt" edc:desc="NVM Write Complete Interrupt" edc:irq="12"/>
    <edc:Interrupt edc:cname="SI2CInterrupt" edc:desc="SI2C1 - I2C1 Slave Events" edc:irq="13"/>
    <edc:Interrupt edc:cname="MI2CInterrupt" edc:desc="MI2C1 - I2C1 Master Events" edc:irq="14"/>
    <edc:Interrupt edc:cname="CNInterrupt" edc:desc="CN -  Change Notification Interrupt" edc:irq="15"/>
    <edc:Interrupt edc:cname="INT1Interrupt" edc:desc="INT1 - External Interrupt 1" edc:irq="16"/>
    <edc:Interrupt edc:cname="IC7Interrupt" edc:desc="IC7 - Input Capture 7" edc:irq="17"/>
    <edc:Interrupt edc:cname="IC8Interrupt" edc:desc="IC8 - Input Capture 8" edc:irq="18"/>
    <edc:Interrupt edc:cname="OC3Interrupt" edc:desc="OC3 - Output Compare 3" edc:irq="19"/>
    <edc:Interrupt edc:cname="OC4Interrupt" edc:desc="OC4 - Output Compare 4" edc:irq="20"/>
    <edc:Interrupt edc:cname="T4Interrupt" edc:desc="T4 - Timer4" edc:irq="21"/>
    <edc:Interrupt edc:cname="T5Interrupt" edc:desc="T5 - Timer5" edc:irq="22"/>
    <edc:Interrupt edc:cname="INT2Interrupt" edc:desc="INT2 - External Interrupt 2" edc:irq="23"/>
    <edc:Interrupt edc:cname="U2RXInterrupt" edc:desc="U2RX - UART2 Receiver" edc:irq="24"/>
    <edc:Interrupt edc:cname="U2TXInterrupt" edc:desc="U2TX - UART2 Transmitter" edc:irq="25"/>
    <edc:Interrupt edc:cname="SPI2Interrupt" edc:desc="SPI2 - SPI2 Transfer Done" edc:irq="26"/>
    <edc:Interrupt edc:cname="C1Interrupt" edc:desc="C1 - ECAN1 Event" edc:irq="27"/>
    <edc:Interrupt edc:cname="IC3Interrupt" edc:desc="IC3 - Input Capture 3" edc:irq="28"/>
    <edc:Interrupt edc:cname="IC4Interrupt" edc:desc="IC4 - Input Capture 4" edc:irq="29"/>
    <edc:Interrupt edc:cname="IC5Interrupt" edc:desc="IC5 - Input Capture 5" edc:irq="30"/>
    <edc:Interrupt edc:cname="IC6Interrupt" edc:desc="IC5 - Input Capture 6" edc:irq="31"/>
    <edc:Interrupt edc:cname="OC5Interrupt" edc:desc="OC5 - Output Compare 5" edc:irq="32"/>
    <edc:Interrupt edc:cname="OC6Interrupt" edc:desc="OC6 - Output Compare 6" edc:irq="33"/>
    <edc:Interrupt edc:cname="OC7Interrupt" edc:desc="OC7 - Output Compare 7" edc:irq="34"/>
    <edc:Interrupt edc:cname="OC8Interrupt" edc:desc="OC8 - Output Compare 8" edc:irq="35"/>
    <edc:Interrupt edc:cname="INT3Interrupt" edc:desc="INT3 - External Interrupt 3" edc:irq="36"/>
    <edc:Interrupt edc:cname="INT4Interrupt" edc:desc="INT4 - External Interrupt 4" edc:irq="37"/>
    <edc:Interrupt edc:cname="C2Interrupt" edc:desc="C2 - ECAN2 Event" edc:irq="38"/>
    <edc:Interrupt edc:cname="PWMInterrupt" edc:desc="PWM - PWM Period Match" edc:irq="39"/>
    <edc:Interrupt edc:cname="QEIInterrupt" edc:desc="QEI - Position Counter Compare" edc:irq="40"/>
    <edc:Interrupt edc:cname="DCIInterrupt" edc:desc="DCI - Interrupt" edc:irq="41"/>
    <edc:Interrupt edc:cname="LVDInterrupt" edc:desc="LVD - Interrupt" edc:irq="42"/>
    <edc:Interrupt edc:cname="FLTAInterrupt" edc:desc="FLTA - MCPWM Fault A" edc:irq="43"/>
    <edc:Interrupt edc:cname="FLTBInterrupt" edc:desc="FLTB - MCPWM Fault B" edc:irq="44"/>
  </edc:InterruptList>
  <edc:Breakpoints edc:hasdatacapture="false" edc:hwbpcount="0x2" edc:idbyte="r"/>
  <edc:ProgramSpace>
    <edc:ResetSector edc:beginaddr="0x0" edc:endaddr="0x4" edc:regionid="reset"/>
    <edc:VectorSector edc:beginaddr="0x04" edc:endaddr="0x80" edc:regionid="ivt"/>
    <edc:CodeSector edc:beginaddr="0x80" edc:endaddr="0x84" edc:isreserved="true" edc:regionid="_reserved"/>
    <edc:AltVectorSector edc:beginaddr="0x84" edc:endaddr="0x100" edc:regionid="aivt"/>
    <edc:CodeSector edc:beginaddr="0x100" edc:endaddr="0x18000" edc:regionid="program"/>
    <edc:EEDataSector edc:beginaddr="0x7ff000" edc:endaddr="0x800000" edc:regionid="eedata"/>
    <edc:TestZone edc:appbeginaddr="0x800080" edc:appendaddr="0x8005c0" edc:beginaddr="0x800000" edc:endaddr="0x800600" edc:regionid="testmem"/>
    <edc:UserIDSector edc:beginaddr="0x8005c0" edc:endaddr="0x800600" edc:regionid="userid">
      <edc:DCRDef edc:access="nn---nnn---nnnnn" edc:cname="FUID0" edc:default="0xf9e0" edc:desc="" edc:impl="0xc71f" edc:name="FUID0" edc:nzwidth="0x10" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xc71f">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0"/>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="nn---nnn---nnnnn" edc:cname="FUID1" edc:default="0xf9e0" edc:desc="" edc:impl="0xc71f" edc:name="FUID1" edc:nzwidth="0x10" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xc71f">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0"/>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="nn---nnn---nnnnn" edc:cname="FUID2" edc:default="0xf9e0" edc:desc="" edc:impl="0xc71f" edc:name="FUID2" edc:nzwidth="0x10" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xc71f">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0"/>
        </edc:DCRModeList>
      </edc:DCRDef>
